MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2025DAH176/mcu.h
extern volatile __GLCDCURDATA4bits_t GLCDCURDATA4bits __asm__ ("GLCDCURDATA4") __attribute__((section("sfrs"), address(0xBF8EA810)));
#define GLCDCURDATA5 GLCDCURDATA5
extern volatile uint32_t   GLCDCURDATA5 __attribute__((section("sfrs"), address(0xBF8EA814)));
typedef struct {
  uint32_t PIXEL115:4;
  uint32_t PIXEL114:4;
  uint32_t PIXEL113:4;
  uint32_t PIXEL112:4;
  uint32_t PIXEL111:4;
  uint32_t PIXEL110:4;
  uint32_t PIXEL19:4;
  uint32_t PIXEL18:4;
} __GLCDCURDATA5bits_t;
extern volatile __GLCDCURDATA5bits_t GLCDCURDATA5bits __asm__ ("GLCDCURDATA5") __attribute__((section("sfrs"), address(0xBF8EA814)));
#define GLCDCURDATA6 GLCDCURDATA6
extern volatile uint32_t   GLCDCURDATA6 __attribute__((section("sfrs"), address(0xBF8EA818)));
typedef struct {
  uint32_t PIXEL123:4;
  uint32_t PIXEL122:4;
  uint32_t PIXEL121:4;
  uint32_t PIXEL120:4;
  uint32_t PIXEL119:4;
  uint32_t PIXEL118:4;
  uint32_t PIXEL117:4;
  uint32_t PIXEL116:4;
} __GLCDCURDATA6bits_t;
extern volatile __GLCDCURDATA6bits_t GLCDCURDATA6bits __asm__ ("GLCDCURDATA6") __attribute__((section("sfrs"), address(0xBF8EA818)));
#define GLCDCURDATA7 GLCDCURDATA7
extern volatile uint32_t   GLCDCURDATA7 __attribute__((section("sfrs"), address(0xBF8EA81C)));
typedef struct {
  uint32_t PIXEL131:4;
  uint32_t PIXEL130:4;
  uint32_t PIXEL129:4;
  uint32_t PIXEL128:4;
  uint32_t PIXEL127:4;
  uint32_t PIXEL126:4;
  uint32_t PIXEL125:4;
  uint32_t PIXEL124:4;
} __GLCDCURDATA7bits_t;
extern volatile __GLCDCURDATA7bits_t GLCDCURDATA7bits __asm__ ("GLCDCURDATA7") __attribute__((section("sfrs"), address(0xBF8EA81C)));
#define GLCDCURDATA8 GLCDCURDATA8
extern volatile uint32_t   GLCDCURDATA8 __attribute__((section("sfrs"), address(0xBF8EA820)));
typedef struct {
  uint32_t PIXEL27:4;
  uint32_t PIXEL26:4;
  uint32_t PIXEL25:4;
  uint32_t PIXEL24:4;
  uint32_t PIXEL23:4;
  uint32_t PIXEL22:4;
  uint32_t PIXEL21:4;
  uint32_t PIXEL20:4;
} __GLCDCURDATA8bits_t;
extern volatile __GLCDCURDATA8bits_t GLCDCURDATA8bits __asm__ ("GLCDCURDATA8") __attribute__((section("sfrs"), address(0xBF8EA820)));
#define GLCDCURDATA9 GLCDCURDATA9
extern volatile uint32_t   GLCDCURDATA9 __attribute__((section("sfrs"), address(0xBF8EA824)));
typedef struct {
  uint32_t PIXEL215:4;
  uint32_t PIXEL214:4;
  uint32_t PIXEL213:4;
  uint32_t PIXEL212:4;
  uint32_t PIXEL211:4;
  uint32_t PIXEL210:4;
  uint32_t PIXEL29:4;
  uint32_t PIXEL28:4;
} __GLCDCURDATA9bits_t;
extern volatile __GLCDCURDATA9bits_t GLCDCURDATA9bits __asm__ ("GLCDCURDATA9") __attribute__((section("sfrs"), address(0xBF8EA824)));
#define GLCDCURDATA10 GLCDCURDATA10
extern volatile uint32_t   GLCDCURDATA10 __attribute__((section("sfrs"), address(0xBF8EA828)));
typedef struct {
  uint32_t PIXEL223:4;
  uint32_t PIXEL222:4;
  uint32_t PIXEL221:4;
  uint32_t PIXEL220:4;
  uint32_t PIXEL219:4;
  uint32_t PIXEL218:4;
  uint32_t PIXEL217:4;
  uint32_t PIXEL216:4;
} __GLCDCURDATA10bits_t;
extern volatile __GLCDCURDATA10bits_t GLCDCURDATA10bits __asm__ ("GLCDCURDATA10") __attribute__((section("sfrs"), address(0xBF8EA828)));
#define GLCDCURDATA11 GLCDCURDATA11
extern volatile uint32_t   GLCDCURDATA11 __attribute__((section("sfrs"), address(0xBF8EA82C)));
typedef struct {
  uint32_t PIXEL231:4;
  uint32_t PIXEL230:4;
  uint32_t PIXEL229:4;
  uint32_t PIXEL228:4;
  uint32_t PIXEL227:4;
  uint32_t PIXEL226:4;
  uint32_t PIXEL225:4;
  uint32_t PIXEL224:4;
} __GLCDCURDATA11bits_t;
extern volatile __GLCDCURDATA11bits_t GLCDCURDATA11bits __asm__ ("GLCDCURDATA11") __attribute__((section("sfrs"), address(0xBF8EA82C)));
#define GLCDCURDATA12 GLCDCURDATA12
extern volatile uint32_t   GLCDCURDATA12 __attribute__((section("sfrs"), address(0xBF8EA830)));
typedef struct {
  uint32_t PIXEL37:4;
  uint32_t PIXEL36:4;
  uint32_t PIXEL35:4;
  uint32_t PIXEL34:4;
  uint32_t PIXEL33:4;
  uint32_t PIXEL32:4;
  uint32_t PIXEL31:4;
  uint32_t PIXEL30:4;
} __GLCDCURDATA12bits_t;
extern volatile __GLCDCURDATA12bits_t GLCDCURDATA12bits __asm__ ("GLCDCURDATA12") __attribute__((section("sfrs"), address(0xBF8EA830)));
#define GLCDCURDATA13 GLCDCURDATA13
extern volatile uint32_t   GLCDCURDATA13 __attribute__((section("sfrs"), address(0xBF8EA834)));
typedef struct {
  uint32_t PIXEL315:4;
  uint32_t PIXEL314:4;
  uint32_t PIXEL313:4;
  uint32_t PIXEL312:4;
  uint32_t PIXEL311:4;
  uint32_t PIXEL310:4;
  uint32_t PIXEL39:4;
  uint32_t PIXEL38:4;
} __GLCDCURDATA13bits_t;
extern volatile __GLCDCURDATA13bits_t GLCDCURDATA13bits __asm__ ("GLCDCURDATA13") __attribute__((section("sfrs"), address(0xBF8EA834)));
#define GLCDCURDATA14 GLCDCURDATA14
extern volatile uint32_t   GLCDCURDATA14 __attribute__((section("sfrs"), address(0xBF8EA838)));
typedef struct {
  uint32_t PIXEL323:4;
  uint32_t PIXEL322:4;
  uint32_t PIXEL321:4;
  uint32_t PIXEL320:4;
  uint32_t PIXEL319:4;
  uint32_t PIXEL318:4;
  uint32_t PIXEL317:4;
  uint32_t PIXEL316:4;
} __GLCDCURDATA14bits_t;
extern volatile __GLCDCURDATA14bits_t GLCDCURDATA14bits __asm__ ("GLCDCURDATA14") __attribute__((section("sfrs"), address(0xBF8EA838)));
#define GLCDCURDATA15 GLCDCURDATA15
extern volatile uint32_t   GLCDCURDATA15 __attribute__((section("sfrs"), address(0xBF8EA83C)));
typedef struct {
  uint32_t PIXEL331:4;
  uint32_t PIXEL330:4;
  uint32_t PIXEL329:4;
  uint32_t PIXEL328:4;
  uint32_t PIXEL327:4;
  uint32_t PIXEL326:4;
  uint32_t PIXEL325:4;
  uint32_t PIXEL324:4;
} __GLCDCURDATA15bits_t;
extern volatile __GLCDCURDATA15bits_t GLCDCURDATA15bits __asm__ ("GLCDCURDATA15") __attribute__((section("sfrs"), address(0xBF8EA83C)));
#define GLCDCURDATA16 GLCDCURDATA16
extern volatile uint32_t   GLCDCURDATA16 __attribute__((section("sfrs"), address(0xBF8EA840)));
typedef struct {
  uint32_t PIXEL47:4;
  uint32_t PIXEL46:4;
  uint32_t PIXEL45:4;
  uint32_t PIXEL44:4;
  uint32_t PIXEL43:4;
  uint32_t PIXEL42:4;
  uint32_t PIXEL41:4;
  uint32_t PIXEL40:4;
} __GLCDCURDATA16bits_t;
extern volatile __GLCDCURDATA16bits_t GLCDCURDATA16bits __asm__ ("GLCDCURDATA16") __attribute__((section("sfrs"), address(0xBF8EA840)));
#define GLCDCURDATA17 GLCDCURDATA17
extern volatile uint32_t   GLCDCURDATA17 __attribute__((section("sfrs"), address(0xBF8EA844)));
typedef struct {
  uint32_t PIXEL415:4;
  uint32_t PIXEL414:4;
  uint32_t PIXEL413:4;
  uint32_t PIXEL412:4;
  uint32_t PIXEL411:4;
  uint32_t PIXEL410:4;
  uint32_t PIXEL49:4;
  uint32_t PIXEL48:4;
} __GLCDCURDATA17bits_t;
extern volatile __GLCDCURDATA17bits_t GLCDCURDATA17bits __asm__ ("GLCDCURDATA17") __attribute__((section("sfrs"), address(0xBF8EA844)));
#define GLCDCURDATA18 GLCDCURDATA18
extern volatile uint32_t   GLCDCURDATA18 __attribute__((section("sfrs"), address(0xBF8EA848)));
typedef struct {
  uint32_t PIXEL423:4;
  uint32_t PIXEL422:4;
  uint32_t PIXEL421:4;
  uint32_t PIXEL420:4;
  uint32_t PIXEL419:4;
  uint32_t PIXEL418:4;
  uint32_t PIXEL417:4;
  uint32_t PIXEL416:4;
} __GLCDCURDATA18bits_t;
extern volatile __GLCDCURDATA18bits_t GLCDCURDATA18bits __asm__ ("GLCDCURDATA18") __attribute__((section("sfrs"), address(0xBF8EA848)));
#define GLCDCURDATA19 GLCDCURDATA19
extern volatile uint32_t   GLCDCURDATA19 __attribute__((section("sfrs"), address(0xBF8EA84C)));
typedef struct {
  uint32_t PIXEL431:4;
  uint32_t PIXEL430:4;
  uint32_t PIXEL429:4;
  uint32_t PIXEL428:4;
  uint32_t PIXEL427:4;
  uint32_t PIXEL426:4;
  uint32_t PIXEL425:4;
  uint32_t PIXEL424:4;
} __GLCDCURDATA19bits_t;
extern volatile __GLCDCURDATA19bits_t GLCDCURDATA19bits __asm__ ("GLCDCURDATA19") __attribute__((section("sfrs"), address(0xBF8EA84C)));
#define GLCDCURDATA20 GLCDCURDATA20
extern volatile uint32_t   GLCDCURDATA20 __attribute__((section("sfrs"), address(0xBF8EA850)));
typedef struct {
  uint32_t PIXEL57:4;
  uint32_t PIXEL56:4;
  uint32_t PIXEL55:4;
  uint32_t PIXEL54:4;
  uint32_t PIXEL53:4;
  uint32_t PIXEL52:4;
  uint32_t PIXEL51:4;
  uint32_t PIXEL50:4;
} __GLCDCURDATA20bits_t;
extern volatile __GLCDCURDATA20bits_t GLCDCURDATA20bits __asm__ ("GLCDCURDATA20") __attribute__((section("sfrs"), address(0xBF8EA850)));
#define GLCDCURDATA21 GLCDCURDATA21
extern volatile uint32_t   GLCDCURDATA21 __attribute__((section("sfrs"), address(0xBF8EA854)));
typedef struct {
  uint32_t PIXEL515:4;
  uint32_t PIXEL514:4;
  uint32_t PIXEL513:4;
  uint32_t PIXEL512:4;
  uint32_t PIXEL511:4;
  uint32_t PIXEL510:4;
  uint32_t PIXEL59:4;
  uint32_t PIXEL58:4;
} __GLCDCURDATA21bits_t;
