MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2025DAH176/mcu.h
#define _GLCDCURLUT12_BLUE_POSITION              0x00000000
#define _GLCDCURLUT12_BLUE_MASK                  0x000000FF
#define _GLCDCURLUT12_BLUE_LENGTH                0x00000008

#define _GLCDCURLUT12_GREEN_POSITION             0x00000008
#define _GLCDCURLUT12_GREEN_MASK                 0x0000FF00
#define _GLCDCURLUT12_GREEN_LENGTH               0x00000008

#define _GLCDCURLUT12_RED_POSITION               0x00000010
#define _GLCDCURLUT12_RED_MASK                   0x00FF0000
#define _GLCDCURLUT12_RED_LENGTH                 0x00000008

#define _GLCDCURLUT13_BLUE_POSITION              0x00000000
#define _GLCDCURLUT13_BLUE_MASK                  0x000000FF
#define _GLCDCURLUT13_BLUE_LENGTH                0x00000008

#define _GLCDCURLUT13_GREEN_POSITION             0x00000008
#define _GLCDCURLUT13_GREEN_MASK                 0x0000FF00
#define _GLCDCURLUT13_GREEN_LENGTH               0x00000008

#define _GLCDCURLUT13_RED_POSITION               0x00000010
#define _GLCDCURLUT13_RED_MASK                   0x00FF0000
#define _GLCDCURLUT13_RED_LENGTH                 0x00000008

#define _GLCDCURLUT14_BLUE_POSITION              0x00000000
#define _GLCDCURLUT14_BLUE_MASK                  0x000000FF
#define _GLCDCURLUT14_BLUE_LENGTH                0x00000008

#define _GLCDCURLUT14_GREEN_POSITION             0x00000008
#define _GLCDCURLUT14_GREEN_MASK                 0x0000FF00
#define _GLCDCURLUT14_GREEN_LENGTH               0x00000008

#define _GLCDCURLUT14_RED_POSITION               0x00000010
#define _GLCDCURLUT14_RED_MASK                   0x00FF0000
#define _GLCDCURLUT14_RED_LENGTH                 0x00000008

#define _GLCDCURLUT15_BLUE_POSITION              0x00000000
#define _GLCDCURLUT15_BLUE_MASK                  0x000000FF
#define _GLCDCURLUT15_BLUE_LENGTH                0x00000008

#define _GLCDCURLUT15_GREEN_POSITION             0x00000008
#define _GLCDCURLUT15_GREEN_MASK                 0x0000FF00
#define _GLCDCURLUT15_GREEN_LENGTH               0x00000008

#define _GLCDCURLUT15_RED_POSITION               0x00000010
#define _GLCDCURLUT15_RED_MASK                   0x00FF0000
#define _GLCDCURLUT15_RED_LENGTH                 0x00000008

#define _SDHCBLKCON_BSIZE_POSITION               0x00000000
#define _SDHCBLKCON_BSIZE_MASK                   0x000003FF
#define _SDHCBLKCON_BSIZE_LENGTH                 0x0000000A

#define _SDHCBLKCON_BCOUNT_POSITION              0x00000010
#define _SDHCBLKCON_BCOUNT_MASK                  0xFFFF0000
#define _SDHCBLKCON_BCOUNT_LENGTH                0x00000010

#define _SDHCARG_ARG_POSITION                    0x00000000
#define _SDHCARG_ARG_MASK                        0xFFFFFFFF
#define _SDHCARG_ARG_LENGTH                      0x00000020

#define _SDHCMODE_DMAEN_POSITION                 0x00000000
#define _SDHCMODE_DMAEN_MASK                     0x00000001
#define _SDHCMODE_DMAEN_LENGTH                   0x00000001

#define _SDHCMODE_BCEN_POSITION                  0x00000001
#define _SDHCMODE_BCEN_MASK                      0x00000002
#define _SDHCMODE_BCEN_LENGTH                    0x00000001

#define _SDHCMODE_ACEN_POSITION                  0x00000002
#define _SDHCMODE_ACEN_MASK                      0x0000000C
#define _SDHCMODE_ACEN_LENGTH                    0x00000002

#define _SDHCMODE_DTXDSEL_POSITION               0x00000004
#define _SDHCMODE_DTXDSEL_MASK                   0x00000010
#define _SDHCMODE_DTXDSEL_LENGTH                 0x00000001

#define _SDHCMODE_BSEL_POSITION                  0x00000005
#define _SDHCMODE_BSEL_MASK                      0x00000020
#define _SDHCMODE_BSEL_LENGTH                    0x00000001

#define _SDHCMODE_RESPTYPE_POSITION              0x00000010
#define _SDHCMODE_RESPTYPE_MASK                  0x00030000
#define _SDHCMODE_RESPTYPE_LENGTH                0x00000002

#define _SDHCMODE_CCRCCEN_POSITION               0x00000013
#define _SDHCMODE_CCRCCEN_MASK                   0x00080000
#define _SDHCMODE_CCRCCEN_LENGTH                 0x00000001

#define _SDHCMODE_CIDXCEN_POSITION               0x00000014
#define _SDHCMODE_CIDXCEN_MASK                   0x00100000
#define _SDHCMODE_CIDXCEN_LENGTH                 0x00000001

#define _SDHCMODE_DPSEL_POSITION                 0x00000015
#define _SDHCMODE_DPSEL_MASK                     0x00200000
#define _SDHCMODE_DPSEL_LENGTH                   0x00000001

#define _SDHCMODE_CTYPE_POSITION                 0x00000016
#define _SDHCMODE_CTYPE_MASK                     0x00C00000
#define _SDHCMODE_CTYPE_LENGTH                   0x00000002

#define _SDHCMODE_CIDX_POSITION                  0x00000018
#define _SDHCMODE_CIDX_MASK                      0x3F000000
#define _SDHCMODE_CIDX_LENGTH                    0x00000006

#define _SDHCRESP0_RESP_POSITION                 0x00000000
#define _SDHCRESP0_RESP_MASK                     0xFFFFFFFF
#define _SDHCRESP0_RESP_LENGTH                   0x00000020

#define _SDHCRESP1_RESP_POSITION                 0x00000000
#define _SDHCRESP1_RESP_MASK                     0xFFFFFFFF
#define _SDHCRESP1_RESP_LENGTH                   0x00000020

#define _SDHCRESP2_RESP_POSITION                 0x00000000
#define _SDHCRESP2_RESP_MASK                     0xFFFFFFFF
#define _SDHCRESP2_RESP_LENGTH                   0x00000020

#define _SDHCRESP3_RESP_POSITION                 0x00000000
#define _SDHCRESP3_RESP_MASK                     0xFFFFFFFF
#define _SDHCRESP3_RESP_LENGTH                   0x00000020

#define _SDHCDATA_DATA_POSITION                  0x00000000
#define _SDHCDATA_DATA_MASK                      0xFFFFFFFF
#define _SDHCDATA_DATA_LENGTH                    0x00000020

#define _SDHCSTAT1_CINHCMD_POSITION              0x00000000
#define _SDHCSTAT1_CINHCMD_MASK                  0x00000001
#define _SDHCSTAT1_CINHCMD_LENGTH                0x00000001

#define _SDHCSTAT1_CINHDAT_POSITION              0x00000001
#define _SDHCSTAT1_CINHDAT_MASK                  0x00000002
#define _SDHCSTAT1_CINHDAT_LENGTH                0x00000001

#define _SDHCSTAT1_DLACTIVE_POSITION             0x00000002
#define _SDHCSTAT1_DLACTIVE_MASK                 0x00000004
#define _SDHCSTAT1_DLACTIVE_LENGTH               0x00000001

#define _SDHCSTAT1_WRACTIVE_POSITION             0x00000008
#define _SDHCSTAT1_WRACTIVE_MASK                 0x00000100
#define _SDHCSTAT1_WRACTIVE_LENGTH               0x00000001

#define _SDHCSTAT1_RDACTIVE_POSITION             0x00000009
#define _SDHCSTAT1_RDACTIVE_MASK                 0x00000200
#define _SDHCSTAT1_RDACTIVE_LENGTH               0x00000001

#define _SDHCSTAT1_BWEN_POSITION                 0x0000000A
#define _SDHCSTAT1_BWEN_MASK                     0x00000400
#define _SDHCSTAT1_BWEN_LENGTH                   0x00000001

